package sec04_thiskeyword.EX01_ThisKeyword_1;

public class ThisKeyword_1 {
	
	public static void main(String[]args) {
		
		/* 7.4 this 키워드와 this() 메서드
		   
		   클래스의 외부에서 멤버(필드, 메서드, 이너 클래스)를 호출하기 위해서는 객체를 먼저 생성한 후 '참조 변수명.멤버명'의 형태로 호출하지만,
		   클래스 내부에서는 개체의 생성 없이 필드와 메서드를 바로 사용할 수 있다고 학습함. 하지만 모든 사용할 수 있는 상태의 멤버는 항상
		   객체 속에만 존재함. 그렇다면 어떻게 클래스 내부에서는 객체를 생성하지 않고 바로 필드와 메서드를 계속 사용 할 수 있을까?
		   
		   7.4.1 내부 객체 참조 변수명인 this 키워드
		   
		   우리는 클래스 내부에서도 객체 안의 멤버를 사용해 옴. 즉, '참조변수명.멤버명'의 형태를 사용해 온 셈. 다만 객체를 직접 만들지 않은 것
		   뿐이지, 모든 메서드에는 자신이 포함된 클래스의 겍체를 가리키는 this라는 참조 변수가 존재함.
		   
		 */
		
	}

}
