package sec01_field.EX01_FieldComponent;

public class FieldComponent {

	public static void main(String[]args) {
		
		/* 7장 클래스 내부 구성 요소
		   7.1 필드와 지역 변수의 구분
		   
		   필드field는 클래스에 포함된 변수로, 객체의 속성값을 지정할 수 있음. 필드는 지역 변수local variable과 구분해야 함. 지역 변수는
		   메서드에 포함된 변수를 의미함. 즉 필드와 지역 변수는 어떤 중괄호 안에 선언됐는지에 따라 구분이 가능함. 클래스의 중괄호 안에 선언된
		   변수는 필드, 메서드의 중괄호 안에 선언된 변수를 지역변수라고 분류하면 됨.
		   필드와 지역변수의 가장 큰 차이점은 생성되는 메모리의 위치임. 필드는 힙 메모리의 객체 내부, 지역 변수는 스택메모리에 생성됨.
		   스택 메모리에 저장되는 변수는 때가 되면 자바 가상 머신이 자동으로 삭제하지만, 힙 메모리의 객체 안에 저장되는 필드는 객체가 사라지지
		   않는 한 절대로 삭제되지 않음.
		   
		   
		   
		 */
		
	}
	
}
